/*-----------------------------INSERT INTO Department--------------------------------*/
INSERT INTO Department 
VALUES("纖維與複合材料學系", "工程與科學學院");
      ("機械與電腦輔助工程學系", "工程與科學學院");
      ("工業工程與系統管理學系", "工程與科學學院");
      ("化學工程學系", "工程與科學學院");
      ("航太與系統工程學系", "工程與科學學院");     
      ("精密系統設計學士學位學程", "工程與科學學院");
      ("應用數學系", "工程與科學學院");
      ("環境工程與科學學系", "工程與科學學院");
      ("材料科學與工程學系", "工程與科學學院");
      ("光電科學與工程學系", "工程與科學學院");
      ("會計學系", "商學院");
      ("國際經營與貿易學系", "商學院");
      ("國際企業管理全英語學士學位學程", "商學院");
      ("財稅學系", "商學院");
      ("合作經濟暨社會事業經營學系", "商學院");
      ("統計學系", "商學院");
      ("經濟學系", "商學院");
      ("企業管理學系", "商學院");
      ("行銷學系", "商學院");
      ("商學學士學位學程", "商學院");
      ("中國文學系", "人文社會學院"),
      ("外國語文學系", "人文社會學院"),
      ("人文社會學士學位學程", "人文社會學院"),
      ("資訊工程學系", "資訊電機學院"),
      ("電機工程學系", "資訊電機學院"),
      ("電子工程學系", "資訊電機學院"),
      ("自動控制工程學系", "資訊電機學院"),
      ("通訊工程學系", "資訊電機學院"),
      ("資訊電機學院學士班", "資訊電機學院"),
      ("土木工程學系", "建設學院"),
      ("水利工程與資源保育學系", "建設學院"),
      ("都市計畫與空間資訊學系", "建設學院"),
      ("運輸與物流學系", "建設學院"),
      ("土地管理學系", "建設學院"),
      ("風險管理與保險學系", "金融學院"),
      ("財務金融學系", "金融學院"),
      ("財務工程與精算學士學位學程", "金融學院"),
      ("澳洲墨爾本皇家理工大學商學與創新雙學士學位學程", "國際科技與管理學院"),
      ("美國加州聖荷西州立大學商學大數據雙學士學位學程", "國際科技與管理學院"),
      ("美國普渡大學電機資訊雙學士學位學程", "國際科技與管理學院"),
      ("美國加州聖荷西州立大學工程雙學士學位學程", "國際科技與管理學院"),
      ("美國加州舊金山州立大學資訊工程雙學士學位學程", "國際科技與管理學院"),
      ("澳洲昆土蘭大學商學雙學士學位學程", "國際科技與管理學院"),
      ("建築專業學院學士班", "建築專業學院"),
      ("建築學士學位學程", "建築專業學院"),
      ("室內設計學士學位學程", "建築專業學院"),
      ("創新設計學士學位學程", "建築專業學院"),
      ("室內設計進修學士班", "建築專業學院"),
      ("人工智慧技術與應用學士學位學程", "創能學院"),
      ("全校國際生大一不分系學士班", "通識教育中心");

/*-----------------------------INSERT INTO Student-----------------------------------*/
INSERT INTO Student 
VALUES("D1059887", "劉宥宏", 2, "丁", "資訊工程學系", 0),
      ("D1059754", "陳螢霆", 2, "丁", "資訊工程學系", 0),
      ("D1060106", "蔡明憲", 2, "丁", "資訊工程學系", 0),
      ("D1060064", "林勤恩", 2, "丁", "資訊工程學系", 0),
      ("D1093071", "林珈辰", 2, "丁", "資訊工程學系", 0),
      ("D1051234", "劉佐勴", 2, "丁", "自動控制工程學系", 0),
      ("D1061234", "陳黯邢", 2, "丁", "通訊工程學系", 0),
      ("D1061234", "蔡闇法", 2, "丁", "電機工程學系", 0);
/*-----------------------------INSERT INTO Course------------------------------------*/
INSERT INTO Course 
VALUES(1260, "系統程式", "資訊工程學系", 2, 3, "必修"),
      (1261, "資料庫系統", "資訊工程學系", 2, 3, "必修"),
      (1262, "機率與統計", "資訊工程學系", 2, 3, "必修"),
      (1263, "互連網路", "資訊工程學系", 2, 3, "選修"),
      (1264, "多媒體系統", "資訊工程學系", 2, 3, "選修"),
      (1265, "組合數學", "資訊工程學系", 2, 3, "選修"),
      (1267, "數位系統設計", "資訊工程學系", 2, 3, "選修"),
      (1268, "數位系統設計實驗", "資訊工程學系", 2, 1, "選修"),
      (1269, "UNIX應用與實務", "資訊工程學系", 2, 2, "選修"),
      (3543, "Web程式設計", "資訊工程學系", 2, 3, "選修"),
      (3545, "系統分析與設計", "資訊工程學系", 2, 3, "選修"),
      (3551, "電子商務安全", "資訊工程學系", 2, 3, "選修"),
      (3552, "電子商務安全", "資訊工程學系", 2, 3, "選修"),
      (, "", "資訊工程學系", 2, , ""),
      (, "", "資訊工程學系", 2, , ""),
      (, "", "資訊工程學系", 2, , ""),
      (, "", "資訊工程學系", 2, , ""),
      (, "", "資訊工程學系", 2, , ""),
      (, "", "資訊工程學系", 2, , ""),
      (, "", "資訊工程學系", 2, , "");
/*-----------------------------INSERT INTO Instructor--------------------------------*/
INSERT INTO Instructor 
VALUES(1, "劉宗杰", "資訊工程學系"),
      (2, "許懷中", "資訊工程學系"),
      (3, "劉怡芬", "資訊工程學系"),
      (4, "葉春秀", "資訊工程學系"),
      (5, "游景盛", "資訊工程學系"),
      (6, "陳德生", "資訊工程學系"),
      (7, "竇其仁", "資訊工程學系"),
      (8, "薛念林", "資訊工程學系"),
      (9, "洪振偉", "資訊工程學系"),
      (10, "劉明機", "資訊工程學系"),
      (11, "魏國瑞", "資訊工程學系"),
      (12, "周澤捷", "資訊工程學系"),
      (, "", "資訊工程學系"),
      (, "", "資訊工程學系"),
      (, "", "資訊工程學系"),
      (, "", "資訊工程學系"),
      (, "", "資訊工程學系"),
      (, "", "資訊工程學系"),
      (, "", "資訊工程學系");
/*-----------------------------INSERT INTO Section-----------------------------------*/
INSERT INTO Section 
VALUES(1260, "系統程式", "資訊二丁", 70, 70, 1),
      (1261, "資料庫系統", "資訊二丁", 71, 71, 2),
      (1262, "機率與統計", "資訊二丁", 70, 61, 3),
      (1263, "互連網路", "資訊二丁", 72, 51, 1),
      (1264, "多媒體系統", "資訊二丁", 72, 69, 4),
      (1265, "組合數學", "資訊二丁", 72, 69, 5),
      (1267, "數位系統設計", "資訊二丁", 60, 33, 6),
      (1268, "數位系統設計實驗", "資訊二丁", 60, 34, 6),
      (1269, "UNIX應用與實務", "資訊二丁", 73, 73, 7),
      (3543, "Web程式設計", "資訊二丁", 63, 63, 8),
      (3545, "系統分析與設計", "資訊二丁", 72, 41, 9),
      (3547, "UNIX應用與實務", "資訊二丁", 72, 68, 10),
      (3551, "電子商務安全", "資訊二丁", 72, 68, 11),
      (3552, "電子商務安全", "資訊二丁", 73, 73, 12),
      (, "", "資訊二丁", , , ),
      (, "", "資訊二丁", , , ),
      (, "", "資訊二丁", , , );
/*-----------------------------INSERT INTO SelectDetail------------------------------*/
/*-----------------------------INSERT INTO LectureDetail-----------------------------*/
/*-----------------------------INSERT INTO TimeSlot----------------------------------*/
INSERT INTO TimeSlot
VALUES(2, 1, 6, 6),
      (2, 2, 3, 4),
      (3, 1, 3, 4),
      (3, 4, 4, 4);
